app/views/users/_giveaways.html.erb

SELECT * FROM `giveaways` INNER JOIN `giveaways_users` ON `giveaways`.id = `giveaways_users`.giveaway_id WHERE (`giveaways_users`.user_id = 33 )
---
<h3>Giveaways</h3>
<% @user.facebook_pages.giveaways.each do |giveaway| %>