app/views/users/show.html.erb

SELECT `facebook_pages`.* FROM `facebook_pages` WHERE (`facebook_pages`.user_id = 24)
---
<h3>Facebook Pages</h3>
<% @user.facebook_pages.each do |page| %>