app/views/giveaways/_form.html.erb

<%= javascript_tag do %>
	$(function(){
		$('input.ui-date-picker').datetimepicker({
			ampm: true
		});
		$('a.add-item').click(function(e){
			e.preventDefault();
			var parent = $(this).parents(".input-group");
			if (parent.find("input").length < 3) {
				$(this).parents(".input-group").append('<li><input class="optional-likes" name="giveaway[optional_likes]" type="text"></li>');
			} else {
				if (parent.find("div.error").length < 1) {
					$(this).parents(".input-group").prepend('<div class="error">You have reached the maximum number of optional likes</div>');
				}
			}
		});
	});
---
SELECT `giveaways`.* FROM `giveaways` WHERE (`giveaways`.`id` = 14) LIMIT 1