app/views/giveaways/show.html.erb

SELECT * FROM `users` INNER JOIN `giveaways_users` ON `users`.id = `giveaways_users`.user_id WHERE (`giveaways_users`.giveaway_id = 2 )
---
  <b>Admins:</b>
	<% @giveaway.users.each do |user| %>