app/views/giveaways/tab.html.erb

    FB.Canvas.setSize();
    FB.Event.subscribe('edge.create', function() {
      $just_liked = true;
      Giveaway.step.one.hide();
      Giveaway.step.two.show();
    });
---
SELECT `giveaways`.* FROM `giveaways` LIMIT 1