app/controllers/authentications_controller.rb

SELECT `authentications`.* FROM `authentications` WHERE (`authentications`.`provider` = 'facebook') AND (`authentications`.`uid` = '808283') LIMIT 1
INSERT INTO `authentications` (`created_at`, `provider`, `token`, `uid`, `updated_at`, `user_id`) VALUES ('2011-05-30 22:08:13', 'facebook', '224405887571151|d8c509f8698861e58a35203f.1-808283|YNv5ukZKRvoU7Csw2_E824MoZkI', '808283', '2011-05-30 22:08:13', 3)
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `fb_pages`, `last_sign_in_at`, `last_sign_in_ip`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`) VALUES ('2011-05-30 22:08:13', NULL, NULL, 'hdn201@nyu.edu', '', NULL, NULL, NULL, NULL, NULL, NULL, 0, '2011-05-30 22:08:13')
INSERT INTO `delayed_jobs` (`attempts`, `created_at`, `failed_at`, `handler`, `last_error`, `locked_at`, `locked_by`, `priority`, `run_at`, `updated_at`) VALUES (0, '2011-05-30 23:12:10', NULL, '--- !ruby/struct:Delayed::PerformableMethod \nobject: !ruby/class User\nmethod_name: :retrieve_pages\nargs: \n- !ruby/ActiveRecord:User \n attributes: \n email: hdn201@nyu.edu\n encrypted_password: \"\"\n reset_password_token: \n reset_password_sent_at: \n remember_created_at: \n sign_in_count: 0\n current_sign_in_at: \n last_sign_in_at: \n current_sign_in_ip: \n last_sign_in_ip: \n created_at: \n updated_at: \n', NULL, NULL, NULL, 0, '2011-05-30 23:12:10', '2011-05-30 23:12:10')
---
  def create
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
      Delayed::Job.enqueue(authentication.user.generate_account)
    elsif current_user
      current_user.authentications.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])
      flash[:notice] = "Authentication successful."
      Delayed::Job.enqueue(current_user.generate_account)
      redirect_to authentications_url
    else
      user = User.new
      user.apply_omniauth(omniauth)
      if user.save