app/controllers/giveaways_controller.rb

SELECT `giveaways`.* FROM `giveaways`
---
  def index
    respond_with(@giveaways = Giveaway.all)

SELECT `giveaways`.* FROM `giveaways` WHERE (`giveaways`.`id` = 1) LIMIT 1
---
  def show
    respond_with(@giveaway = Giveaway.find(params[:id]))

SELECT `giveaways`.* FROM `giveaways` WHERE (`giveaways`.`id` = 14) LIMIT 1
---
  def edit
    @giveaway = Giveaway.find(params[:id])

INSERT INTO `giveaways` (`created_at`, `description`, `end_date`, `facebook_page_id`, `feed_image_content_type`, `feed_image_file_name`, `feed_image_file_size`, `giveaway_url`, `image_content_type`, `image_file_name`, `image_file_size`, `must_like`, `optional_likes`, `prize`, `start_date`, `terms`, `title`, `updated_at`) VALUES ('2011-06-22 01:08:34', 'SGA Test Description', '2011-08-01 06:00:00', 171, 'image/jpeg', 'avatar_square.jpg', 154197, NULL, 'image/png', 'social_network_harris.png', 400339, 1, '', 'SGA Test Prize', '2011-07-01 06:00:00', 'http://simplegiveawayapp.com/terms', 'SGA Test Title', '2011-06-22 01:08:34')
---
  def create
    @params = params[:giveaway]

    @giveaway = current_user.giveaways.new(@params)

    @giveaway.start_date = DateTime.strptime(@params[:start_date], "%m/%d/%Y %H:%M")
    @giveaway.end_date = DateTime.strptime(@params[:end_date], "%m/%d/%Y %H:%M")

    current_user.giveaways << @giveaway

SELECT `giveaways`.* FROM `giveaways` WHERE (`giveaways`.`id` = 16) LIMIT 1
UPDATE `giveaways` SET `end_date` = '2011-05-06 13:30:00', `start_date` = '2011-05-06 07:30:00', `updated_at` = '2011-06-06 01:41:01' WHERE (`giveaways`.`id` = 16)
---
  def update
    @giveaway = Giveaway.find(params[:id])

    respond_to do |format|
      if @giveaway.update_attributes(params[:giveaway])

SELECT `giveaways`.* FROM `giveaways` WHERE (`giveaways`.`id` = 14) LIMIT 1
DELETE FROM `giveaways` WHERE (`giveaways`.`id` = 14)
---
  def destroy
    @giveaway = Giveaway.find(params[:id])
    @giveaway.destroy

SELECT `giveaways`.* FROM `giveaways` WHERE `giveaways`.`id` = 3 LIMIT 1
UPDATE `giveaways` SET `start_date` = '2011-07-07 05:03:16', `updated_at` = '2011-07-07 05:03:16' WHERE `giveaways`.`id` = 3
---
  def manual_start
    @giveaway = Giveaway.find(params[:id])
    if @giveaway.update_attributes(:start_date => Time.now)

SELECT `giveaways`.* FROM `giveaways` WHERE `giveaways`.`id` = 3 LIMIT 1
UPDATE `giveaways` SET `end_date` = '2011-07-07 04:58:24', `updated_at` = '2011-07-07 04:58:24' WHERE `giveaways`.`id` = 3
---
  def manual_end
    @giveaway = Giveaway.find(params[:id])
    @giveaway.update_attributes(:end_date => Time.now)