app/controllers/users_controller.rb

SELECT * FROM `facebook_pages` INNER JOIN `facebook_pages_users` ON `facebook_pages`.id = `facebook_pages_users`.facebook_page_id WHERE (`facebook_pages_users`.user_id = 33 )
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 0) LIMIT 1
---
  def show
    @user = User.find(params[:id], :include => [:facebook_pages])